In [2]:
!pip install pymysql;

Collecting pymysql
  Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 44.8/44.8 kB 1.5 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0

In [3]:
%load_ext sql

In [4]:
%sql sqlite:///ABC_DATA

Creating tables ie Customer, Products, orders and order_items

In [5]:
%%sql create table customer(
    customer_id INT NOT NULL PRIMARY KEY,
    first_name VARCHAR(25),
    last_name VARCHAR(25),
    email VARCHAR(30)
);

 * sqlite:///ABC_DATA
Done.

[]

In [ ]:
%%sql PRAGMA table_info(customer);

 * sqlite:///ABC_DATA
Done.

[(0, 'customer_id', 'INT', 1, None, 1),
 (1, 'first_name', 'VARCHAR(25)', 0, None, 0),
 (2, 'last_name', 'VARCHAR(25)', 0, None, 0),
 (3, 'email', 'VARCHAR(30)', 0, None, 0)]

In [6]:
%%sql create table products(
    product_id INT NOT NULL PRIMARY KEY,
    product_name VARCHAR(25),
    price DECIMAL(6,2)
);

 * sqlite:///ABC_DATA
Done.

[]

In [ ]:
%%sql PRAGMA table_info(products);

 * sqlite:///ABC_DATA
Done.

[(0, 'product_id', 'INT', 1, None, 1),
 (1, 'product_name', 'VARCHAR(25)', 0, None, 0),
 (2, 'price', 'DECIMAL(6,2)', 0, None, 0)]

In [7]:
%%sql create table orders(
    order_id INT NOT NULL PRIMARY KEY,
    customer_id INT,
    order_date DATE
);

 * sqlite:///ABC_DATA
Done.

[]

In [ ]:
%%sql PRAGMA table_info(orders)

 * sqlite:///ABC_DATA
Done.

[(0, 'order_id', 'INT', 1, None, 1),
 (1, 'customer_id', 'INT', 0, None, 0),
 (2, 'order_date', 'DATE', 0, None, 0)]

In [8]:
%%sql create table order_item(
    order_id INT,
    product_id INT,
    quantity INT(6)
);

 * sqlite:///ABC_DATA
Done.

[]

In [ ]:
%%sql PRAGMA table_info(order_item)

 * sqlite:///ABC_DATA
Done.

[(0, 'order_id', 'INT', 0, None, 0),
 (1, 'product_id', 'INT', 0, None, 0),
 (2, 'quantity', 'INT(6)', 0, None, 0)]

Inserting Values in the created tables

In [9]:
%%sql INSERT INTO customer(
    customer_id, first_name, last_name, email
)VALUES
(1,'John','Doe','johndoe@gmail.com'),
(2,'Jane','Smith','janesmith@gmail.com'),
(3,'Bob','Johnson','bobjohnson@gmail.com'),
(4,'Alice','Brown','alicebrown@gmail.com'),
(5,'Charles','Davis','charlesdavis@gmail.com'),
(6,'Eva','Fischer','evafischer@gmail.com'),
(7,'George','Harris','georgeharris@gmail.com'),
(8,'Ivy','Jones','ivyjones@gmail.com'),
(9,'Kevin','Miller','kevinmiller@gmail.com'),
(10,'Lily','Nelson','lilynelson@gmail.com'),
(11,'Oliver','Patterson','oliverpatterson@gmail.com'),
(12,'Quinn','Roberts','quinnroberts@gmail.com'),
(13,'Sophia','Thomas','sophiathomas@gmail.com');

 * sqlite:///ABC_DATA
13 rows affected.

[]

In [ ]:
%%sql Select *
From customer

 * sqlite:///ABC_DATA
Done.

[(1, 'John', 'Doe', 'johndoe@gmail.com'),
 (2, 'Jane', 'Smith', 'janesmith@gmail.com'),
 (3, 'Bob', 'Johnson', 'bobjohnson@gmail.com'),
 (4, 'Alice', 'Brown', 'alicebrown@gmail.com'),
 (5, 'Charles', 'Davis', 'charlesdavis@gmail.com'),
 (6, 'Eva', 'Fischer', 'evafischer@gmail.com'),
 (7, 'George', 'Harris', 'georgeharris@gmail.com'),
 (8, 'Ivy', 'Jones', 'ivyjones@gmail.com'),
 (9, 'Kevin', 'Miller', 'kevinmiller@gmail.com'),
 (10, 'Lily', 'Nelson', 'lilynelson@gmail.com'),
 (11, 'Oliver', 'Patterson', 'oliverpatterson@gmail.com'),
 (12, 'Quinn', 'Roberts', 'quinnroberts@gmail.com'),
 (13, 'Sophia', 'Thomas', 'sophiathomas@gmail.com')]

In [10]:
%%sql INSERT INTO  products(
    product_id, product_name, price
) VALUES
(1,'Product A',10.00),
(2,'Product B',15.00),
(3,'Product C',20.00),
(4,'Product D',25.00),
(5,'Product E',30.00),
(6,'Product F',35.00),
(7,'Product G',40.00),
(8,'Product H',45.00),
(9,'Product I',50.00),
(10,'Product J',55.00),
(11,'Product K',60.00),
(12,'Product L',65.00),
(13,'Product M',70.00);

 * sqlite:///ABC_DATA
13 rows affected.

[]

In [ ]:
%%sql Select *
From products;

 * sqlite:///ABC_DATA
Done.

[(1, 'Product A', 10),
 (2, 'Product B', 15),
 (3, 'Product C', 20),
 (4, 'Product D', 25),
 (5, 'Product E', 30),
 (6, 'Product F', 35),
 (7, 'Product G', 40),
 (8, 'Product H', 45),
 (9, 'Product I', 50),
 (10, 'Product J', 55),
 (11, 'Product K', 60),
 (12, 'Product L', 65),
 (13, 'Product M', 70)]

In [11]:
%%sql INSERT INTO orders(
    order_id, customer_id, order_date
)VALUES
(1,1,'2023-05-01'),
(2,2,'2023-05-02'),
(3,3,'2023-05-03'),
(4,1,'2023-05-04'),
(5,2,'2023-05-05'),
(6,3,'2023-05-06'),
(7,4,'2023-05-07'),
(8,5,'2023-05-08'),
(9,6,'2023-05-09'),
(10,7,'2023-05-10'),
(11,8,'2023-05-11'),
(12,9,'2023-05-12'),
(13,10,'2023-05-13'),
(14,11,'2023-05-14'),
(15,12,'2023-05-15'),
(16,13,'2023-05-16');

 * sqlite:///ABC_DATA
16 rows affected.

[]

In [ ]:
%%sql Select *
From orders;

 * sqlite:///ABC_DATA
Done.

[(1, 1, '2023-05-01'),
 (2, 2, '2023-05-02'),
 (3, 3, '2023-05-03'),
 (4, 1, '2023-05-04'),
 (5, 2, '2023-05-05'),
 (6, 3, '2023-05-06'),
 (7, 4, '2023-05-07'),
 (8, 5, '2023-05-08'),
 (9, 6, '2023-05-09'),
 (10, 7, '2023-05-10'),
 (11, 8, '2023-05-11'),
 (12, 9, '2023-05-12'),
 (13, 10, '2023-05-13'),
 (14, 11, '2023-05-14'),
 (15, 12, '2023-05-15'),
 (16, 13, '2023-05-16')]

In [12]:
%%sql INSERT INTO order_item(
    order_id, product_id, quantity
)Values
(1,1,2),
(1,2,1),
(2,2,1),
(2,3,3),
(3,1,1),
(3,3,2),
(4,2,4),
(4,3,1),
(5,1,1),
(5,3,2),
(6,2,3),
(6,1,1),
(7,4,1),
(7,5,2),
(8,6,3),
(8,7,1),
(9,8,2),
(9,9,1),
(10,10,3),
(10,11,2),
(11,12,1),
(11,13,3),
(12,4,2),
(12,5,1),
(13,6,3),
(13,7,2),
(14,8,1),
(14,9,2),
(15,10,3),
(15,11,1),
(16,12,2),
(16,13,3);

 * sqlite:///ABC_DATA
32 rows affected.

[]

In [ ]:
%%sql Select *
From order_item;

 * sqlite:///ABC_DATA
Done.

[(1, 1, 2),
 (1, 2, 1),
 (2, 2, 1),
 (2, 3, 3),
 (3, 1, 1),
 (3, 3, 2),
 (4, 2, 4),
 (4, 3, 1),
 (5, 1, 1),
 (5, 3, 2),
 (6, 2, 3),
 (6, 1, 1),
 (7, 4, 1),
 (7, 5, 2),
 (8, 6, 3),
 (8, 7, 1),
 (9, 8, 2),
 (9, 9, 1),
 (10, 10, 3),
 (10, 11, 2),
 (11, 12, 1),
 (11, 13, 3),
 (12, 4, 2),
 (12, 5, 1),
 (13, 6, 3),
 (13, 7, 2),
 (14, 8, 1),
 (14, 9, 2),
 (15, 10, 3),
 (15, 11, 1),
 (16, 12, 2),
 (16, 13, 3)]

Product with the highest price

In [ ]:
%%sql SELECT *
FROM products
WHERE price = (select max(price) from products);

 * sqlite:///ABC_DATA
Done.

[(13, 'Product M', 70)]

Order_id with the highest number of items interms of quantity

In [ ]:
%%sql SELECT *
FROM order_item
WHERE quantity = (select max(quantity) from order_item)

 * sqlite:///ABC_DATA
Done.

[(4, 2, 4)]

Customer with the highest order

In [ ]:
%%sql SELECT customer_id, count(order_id)
FROM orders
GROUP BY order_id

 * sqlite:///ABC_DATA
Done.

[(1, 16)]

Customers with the highest order

In [17]:
%%sql WITH order_counts as(
    SELECT customer_id, count(order_id) AS order_count
    FROM orders
    GROUP BY customer_id),
  max_order_count AS (
    SELECT max(order_count) as max_count
    FROM order_counts)
  SELECT c.first_name, c.last_name
  FROM customer c
  JOIN order_counts oc ON c.customer_id = oc.customer_id
  JOIN max_order_count moc ON oc.order_count = moc.max_count

 * sqlite:///ABC_DATA
Done.

[('John', 'Doe'), ('Jane', 'Smith'), ('Bob', 'Johnson')]

Total revenue per product

In [18]:
%%sql SELECT p.product_name,
p.price * sum(oi.quantity) AS total_revenue
FROM products p
JOIN order_item oi ON oi.product_id = p.product_id
GROUP BY p.product_id, p.product_name
ORDER BY 2 DESC;

 * sqlite:///ABC_DATA
Done.

[('Product M', 420),
 ('Product J', 330),
 ('Product F', 210),
 ('Product L', 195),
 ('Product K', 180),
 ('Product C', 160),
 ('Product I', 150),
 ('Product B', 135),
 ('Product H', 135),
 ('Product G', 120),
 ('Product E', 90),
 ('Product D', 75),
 ('Product A', 50)]

The day with the Highest revenue

In [25]:
%%sql SELECT order_date,
p.price * sum(oi.quantity) AS total_revenue
FROM orders o
JOIN order_item oi ON o.order_id = oi.order_id
JOIN products p ON oi.product_id = p.product_id
GROUP BY o.order_date
ORDER BY 1 DESC;

 * sqlite:///ABC_DATA
Done.

[('2023-05-16', 325),
 ('2023-05-15', 220),
 ('2023-05-14', 135),
 ('2023-05-13', 175),
 ('2023-05-12', 75),
 ('2023-05-11', 260),
 ('2023-05-10', 275),
 ('2023-05-09', 135),
 ('2023-05-08', 140),
 ('2023-05-07', 75),
 ('2023-05-06', 60),
 ('2023-05-05', 30),
 ('2023-05-04', 75),
 ('2023-05-03', 30),
 ('2023-05-02', 60),
 ('2023-05-01', 30)]